7767517
1244 1488
Input            x                        0 1 x
Split            splitncnn_input0         1 4 x x_splitncnn_0 x_splitncnn_1 x_splitncnn_2 x_splitncnn_3
Convolution      Conv_0                   1 1 x_splitncnn_3 conv2d_328.tmp_0 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=1728
ReLU             Relu_0                   1 1 conv2d_328.tmp_0 relu_0.tmp_0
Split            splitncnn_0              1 2 relu_0.tmp_0 relu_0.tmp_0_splitncnn_0 relu_0.tmp_0_splitncnn_1
Convolution      Conv_1                   1 1 relu_0.tmp_0_splitncnn_1 conv2d_329.tmp_0 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=36864
ReLU             Relu_1                   1 1 conv2d_329.tmp_0 relu_1.tmp_0
Split            splitncnn_1              1 2 relu_1.tmp_0 relu_1.tmp_0_splitncnn_0 relu_1.tmp_0_splitncnn_1
Convolution      Conv_2                   1 1 relu_1.tmp_0_splitncnn_1 conv2d_330.tmp_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=4096
ReLU             Relu_2                   1 1 conv2d_330.tmp_0 relu_2.tmp_0
Convolution      Conv_3                   1 1 relu_2.tmp_0 conv2d_331.tmp_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=36864
ReLU             Relu_3                   1 1 conv2d_331.tmp_0 relu_3.tmp_0
Convolution      Conv_4                   1 1 relu_3.tmp_0 conv2d_332.tmp_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
Convolution      Conv_5                   1 1 relu_1.tmp_0_splitncnn_0 conv2d_333.tmp_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
BinaryOp         Add_0                    2 1 conv2d_332.tmp_0 conv2d_333.tmp_0 elementwise_add_0 0=0
ReLU             Relu_4                   1 1 elementwise_add_0 relu_4.tmp_0
Split            splitncnn_2              1 2 relu_4.tmp_0 relu_4.tmp_0_splitncnn_0 relu_4.tmp_0_splitncnn_1
Convolution      Conv_6                   1 1 relu_4.tmp_0_splitncnn_1 conv2d_334.tmp_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
ReLU             Relu_5                   1 1 conv2d_334.tmp_0 relu_5.tmp_0
Convolution      Conv_7                   1 1 relu_5.tmp_0 conv2d_335.tmp_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=36864
ReLU             Relu_6                   1 1 conv2d_335.tmp_0 relu_6.tmp_0
Convolution      Conv_8                   1 1 relu_6.tmp_0 conv2d_336.tmp_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
BinaryOp         Add_1                    2 1 conv2d_336.tmp_0 relu_4.tmp_0_splitncnn_0 elementwise_add_1 0=0
ReLU             Relu_7                   1 1 elementwise_add_1 relu_7.tmp_0
Split            splitncnn_3              1 2 relu_7.tmp_0 relu_7.tmp_0_splitncnn_0 relu_7.tmp_0_splitncnn_1
Convolution      Conv_9                   1 1 relu_7.tmp_0_splitncnn_1 conv2d_337.tmp_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
ReLU             Relu_8                   1 1 conv2d_337.tmp_0 relu_8.tmp_0
Convolution      Conv_10                  1 1 relu_8.tmp_0 conv2d_338.tmp_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=36864
ReLU             Relu_9                   1 1 conv2d_338.tmp_0 relu_9.tmp_0
Convolution      Conv_11                  1 1 relu_9.tmp_0 conv2d_339.tmp_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
BinaryOp         Add_2                    2 1 conv2d_339.tmp_0 relu_7.tmp_0_splitncnn_0 elementwise_add_2 0=0
ReLU             Relu_10                  1 1 elementwise_add_2 relu_10.tmp_0
Split            splitncnn_4              1 2 relu_10.tmp_0 relu_10.tmp_0_splitncnn_0 relu_10.tmp_0_splitncnn_1
Convolution      Conv_12                  1 1 relu_10.tmp_0_splitncnn_1 conv2d_340.tmp_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
ReLU             Relu_11                  1 1 conv2d_340.tmp_0 relu_11.tmp_0
Convolution      Conv_13                  1 1 relu_11.tmp_0 conv2d_341.tmp_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=36864
ReLU             Relu_12                  1 1 conv2d_341.tmp_0 relu_12.tmp_0
Convolution      Conv_14                  1 1 relu_12.tmp_0 conv2d_342.tmp_0 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=16384
BinaryOp         Add_3                    2 1 conv2d_342.tmp_0 relu_10.tmp_0_splitncnn_0 elementwise_add_3 0=0
ReLU             Relu_13                  1 1 elementwise_add_3 relu_13.tmp_0
Split            splitncnn_5              1 2 relu_13.tmp_0 relu_13.tmp_0_splitncnn_0 relu_13.tmp_0_splitncnn_1
Convolution      Conv_15                  1 1 relu_13.tmp_0_splitncnn_1 conv2d_343.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=41472
ReLU             Relu_14                  1 1 conv2d_343.tmp_0 relu_14.tmp_0
Split            splitncnn_6              1 2 relu_14.tmp_0 relu_14.tmp_0_splitncnn_0 relu_14.tmp_0_splitncnn_1
Convolution      Conv_16                  1 1 relu_13.tmp_0_splitncnn_0 conv2d_344.tmp_0 0=36 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=82944
ReLU             Relu_15                  1 1 conv2d_344.tmp_0 relu_15.tmp_0
Split            splitncnn_7              1 2 relu_15.tmp_0 relu_15.tmp_0_splitncnn_0 relu_15.tmp_0_splitncnn_1
Convolution      Conv_17                  1 1 relu_14.tmp_0_splitncnn_1 conv2d_345.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_16                  1 1 conv2d_345.tmp_0 relu_16.tmp_0
Convolution      Conv_18                  1 1 relu_16.tmp_0 conv2d_346.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_4                    2 1 conv2d_346.tmp_0 relu_14.tmp_0_splitncnn_0 elementwise_add_4 0=0
ReLU             Relu_17                  1 1 elementwise_add_4 relu_17.tmp_0
Split            splitncnn_8              1 2 relu_17.tmp_0 relu_17.tmp_0_splitncnn_0 relu_17.tmp_0_splitncnn_1
Convolution      Conv_19                  1 1 relu_17.tmp_0_splitncnn_1 conv2d_347.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_18                  1 1 conv2d_347.tmp_0 relu_18.tmp_0
Convolution      Conv_20                  1 1 relu_18.tmp_0 conv2d_348.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_5                    2 1 conv2d_348.tmp_0 relu_17.tmp_0_splitncnn_0 elementwise_add_5 0=0
ReLU             Relu_19                  1 1 elementwise_add_5 relu_19.tmp_0
Split            splitncnn_9              1 2 relu_19.tmp_0 relu_19.tmp_0_splitncnn_0 relu_19.tmp_0_splitncnn_1
Convolution      Conv_21                  1 1 relu_19.tmp_0_splitncnn_1 conv2d_349.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_20                  1 1 conv2d_349.tmp_0 relu_20.tmp_0
Convolution      Conv_22                  1 1 relu_20.tmp_0 conv2d_350.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_6                    2 1 conv2d_350.tmp_0 relu_19.tmp_0_splitncnn_0 elementwise_add_6 0=0
ReLU             Relu_21                  1 1 elementwise_add_6 relu_21.tmp_0
Split            splitncnn_10             1 2 relu_21.tmp_0 relu_21.tmp_0_splitncnn_0 relu_21.tmp_0_splitncnn_1
Convolution      Conv_23                  1 1 relu_21.tmp_0_splitncnn_1 conv2d_351.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_22                  1 1 conv2d_351.tmp_0 relu_22.tmp_0
Convolution      Conv_24                  1 1 relu_22.tmp_0 conv2d_352.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_7                    2 1 conv2d_352.tmp_0 relu_21.tmp_0_splitncnn_0 elementwise_add_7 0=0
ReLU             Relu_23                  1 1 elementwise_add_7 relu_23.tmp_0
Split            splitncnn_11             1 3 relu_23.tmp_0 relu_23.tmp_0_splitncnn_0 relu_23.tmp_0_splitncnn_1 relu_23.tmp_0_splitncnn_2
Convolution      Conv_25                  1 1 relu_15.tmp_0_splitncnn_1 conv2d_353.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_24                  1 1 conv2d_353.tmp_0 relu_24.tmp_0
Convolution      Conv_26                  1 1 relu_24.tmp_0 conv2d_354.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_8                    2 1 conv2d_354.tmp_0 relu_15.tmp_0_splitncnn_0 elementwise_add_8 0=0
ReLU             Relu_25                  1 1 elementwise_add_8 relu_25.tmp_0
Split            splitncnn_12             1 2 relu_25.tmp_0 relu_25.tmp_0_splitncnn_0 relu_25.tmp_0_splitncnn_1
Convolution      Conv_27                  1 1 relu_25.tmp_0_splitncnn_1 conv2d_355.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_26                  1 1 conv2d_355.tmp_0 relu_26.tmp_0
Convolution      Conv_28                  1 1 relu_26.tmp_0 conv2d_356.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_9                    2 1 conv2d_356.tmp_0 relu_25.tmp_0_splitncnn_0 elementwise_add_9 0=0
ReLU             Relu_27                  1 1 elementwise_add_9 relu_27.tmp_0
Split            splitncnn_13             1 2 relu_27.tmp_0 relu_27.tmp_0_splitncnn_0 relu_27.tmp_0_splitncnn_1
Convolution      Conv_29                  1 1 relu_27.tmp_0_splitncnn_1 conv2d_357.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_28                  1 1 conv2d_357.tmp_0 relu_28.tmp_0
Convolution      Conv_30                  1 1 relu_28.tmp_0 conv2d_358.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_10                   2 1 conv2d_358.tmp_0 relu_27.tmp_0_splitncnn_0 elementwise_add_10 0=0
ReLU             Relu_29                  1 1 elementwise_add_10 relu_29.tmp_0
Split            splitncnn_14             1 2 relu_29.tmp_0 relu_29.tmp_0_splitncnn_0 relu_29.tmp_0_splitncnn_1
Convolution      Conv_31                  1 1 relu_29.tmp_0_splitncnn_1 conv2d_359.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_30                  1 1 conv2d_359.tmp_0 relu_30.tmp_0
Convolution      Conv_32                  1 1 relu_30.tmp_0 conv2d_360.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_11                   2 1 conv2d_360.tmp_0 relu_29.tmp_0_splitncnn_0 elementwise_add_11 0=0
ReLU             Relu_31                  1 1 elementwise_add_11 relu_31.tmp_0
Split            splitncnn_15             1 2 relu_31.tmp_0 relu_31.tmp_0_splitncnn_0 relu_31.tmp_0_splitncnn_1
Shape            Shape_0                  1 1 relu_23.tmp_0_splitncnn_2 Shape_0
Cast             Cast_0                   1 1 Shape_0 shape_0.tmp_0
Crop             Slice_0                  1 1 shape_0.tmp_0 shape_0.tmp_0_slice_0 -23309=0 -23310=0
Convolution      Conv_33                  1 1 relu_31.tmp_0_splitncnn_1 conv2d_361.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=648
Split            splitncnn_16             1 2 conv2d_361.tmp_0 conv2d_361.tmp_0_splitncnn_0 conv2d_361.tmp_0_splitncnn_1
Shape            Shape_1                  1 1 conv2d_361.tmp_0_splitncnn_1 Shape_1
Crop             Slice_1                  1 1 Shape_1 Slice_1 -23309=1,0 -23310=1,2
Cast             Cast_1                   1 1 shape_0.tmp_0_slice_0 Cast_1
Concat           Concat_0                 2 1 Slice_1 Cast_1 Concat_0 0=0
Interp           Resize_0                 2 1 conv2d_361.tmp_0_splitncnn_0 Concat_0 bilinear_interp_v2_0.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_12                   2 1 relu_23.tmp_0_splitncnn_1 bilinear_interp_v2_0.tmp_0 tmp_0 0=0
ReLU             Relu_32                  1 1 tmp_0 relu_32.tmp_0
Split            splitncnn_17             1 2 relu_32.tmp_0 relu_32.tmp_0_splitncnn_0 relu_32.tmp_0_splitncnn_1
Convolution      Conv_34                  1 1 relu_23.tmp_0_splitncnn_0 conv2d_362.tmp_0 0=36 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=5832
BinaryOp         Add_13                   2 1 relu_31.tmp_0_splitncnn_0 conv2d_362.tmp_0 tmp_1 0=0
ReLU             Relu_33                  1 1 tmp_1 relu_33.tmp_0
Split            splitncnn_18             1 3 relu_33.tmp_0 relu_33.tmp_0_splitncnn_0 relu_33.tmp_0_splitncnn_1 relu_33.tmp_0_splitncnn_2
Convolution      Conv_35                  1 1 relu_33.tmp_0_splitncnn_2 conv2d_363.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=23328
ReLU             Relu_34                  1 1 conv2d_363.tmp_0 relu_34.tmp_0
Split            splitncnn_19             1 2 relu_34.tmp_0 relu_34.tmp_0_splitncnn_0 relu_34.tmp_0_splitncnn_1
Convolution      Conv_36                  1 1 relu_32.tmp_0_splitncnn_1 conv2d_364.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_35                  1 1 conv2d_364.tmp_0 relu_35.tmp_0
Convolution      Conv_37                  1 1 relu_35.tmp_0 conv2d_365.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_14                   2 1 conv2d_365.tmp_0 relu_32.tmp_0_splitncnn_0 elementwise_add_12 0=0
ReLU             Relu_36                  1 1 elementwise_add_12 relu_36.tmp_0
Split            splitncnn_20             1 2 relu_36.tmp_0 relu_36.tmp_0_splitncnn_0 relu_36.tmp_0_splitncnn_1
Convolution      Conv_38                  1 1 relu_36.tmp_0_splitncnn_1 conv2d_366.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_37                  1 1 conv2d_366.tmp_0 relu_37.tmp_0
Convolution      Conv_39                  1 1 relu_37.tmp_0 conv2d_367.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_15                   2 1 conv2d_367.tmp_0 relu_36.tmp_0_splitncnn_0 elementwise_add_13 0=0
ReLU             Relu_38                  1 1 elementwise_add_13 relu_38.tmp_0
Split            splitncnn_21             1 2 relu_38.tmp_0 relu_38.tmp_0_splitncnn_0 relu_38.tmp_0_splitncnn_1
Convolution      Conv_40                  1 1 relu_38.tmp_0_splitncnn_1 conv2d_368.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_39                  1 1 conv2d_368.tmp_0 relu_39.tmp_0
Convolution      Conv_41                  1 1 relu_39.tmp_0 conv2d_369.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_16                   2 1 conv2d_369.tmp_0 relu_38.tmp_0_splitncnn_0 elementwise_add_14 0=0
ReLU             Relu_40                  1 1 elementwise_add_14 relu_40.tmp_0
Split            splitncnn_22             1 2 relu_40.tmp_0 relu_40.tmp_0_splitncnn_0 relu_40.tmp_0_splitncnn_1
Convolution      Conv_42                  1 1 relu_40.tmp_0_splitncnn_1 conv2d_370.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_41                  1 1 conv2d_370.tmp_0 relu_41.tmp_0
Convolution      Conv_43                  1 1 relu_41.tmp_0 conv2d_371.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_17                   2 1 conv2d_371.tmp_0 relu_40.tmp_0_splitncnn_0 elementwise_add_15 0=0
ReLU             Relu_42                  1 1 elementwise_add_15 relu_42.tmp_0
Split            splitncnn_23             1 4 relu_42.tmp_0 relu_42.tmp_0_splitncnn_0 relu_42.tmp_0_splitncnn_1 relu_42.tmp_0_splitncnn_2 relu_42.tmp_0_splitncnn_3
Convolution      Conv_44                  1 1 relu_33.tmp_0_splitncnn_1 conv2d_372.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_43                  1 1 conv2d_372.tmp_0 relu_43.tmp_0
Convolution      Conv_45                  1 1 relu_43.tmp_0 conv2d_373.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_18                   2 1 conv2d_373.tmp_0 relu_33.tmp_0_splitncnn_0 elementwise_add_16 0=0
ReLU             Relu_44                  1 1 elementwise_add_16 relu_44.tmp_0
Split            splitncnn_24             1 2 relu_44.tmp_0 relu_44.tmp_0_splitncnn_0 relu_44.tmp_0_splitncnn_1
Convolution      Conv_46                  1 1 relu_44.tmp_0_splitncnn_1 conv2d_374.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_45                  1 1 conv2d_374.tmp_0 relu_45.tmp_0
Convolution      Conv_47                  1 1 relu_45.tmp_0 conv2d_375.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_19                   2 1 conv2d_375.tmp_0 relu_44.tmp_0_splitncnn_0 elementwise_add_17 0=0
ReLU             Relu_46                  1 1 elementwise_add_17 relu_46.tmp_0
Split            splitncnn_25             1 2 relu_46.tmp_0 relu_46.tmp_0_splitncnn_0 relu_46.tmp_0_splitncnn_1
Convolution      Conv_48                  1 1 relu_46.tmp_0_splitncnn_1 conv2d_376.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_47                  1 1 conv2d_376.tmp_0 relu_47.tmp_0
Convolution      Conv_49                  1 1 relu_47.tmp_0 conv2d_377.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_20                   2 1 conv2d_377.tmp_0 relu_46.tmp_0_splitncnn_0 elementwise_add_18 0=0
ReLU             Relu_48                  1 1 elementwise_add_18 relu_48.tmp_0
Split            splitncnn_26             1 2 relu_48.tmp_0 relu_48.tmp_0_splitncnn_0 relu_48.tmp_0_splitncnn_1
Convolution      Conv_50                  1 1 relu_48.tmp_0_splitncnn_1 conv2d_378.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_49                  1 1 conv2d_378.tmp_0 relu_49.tmp_0
Convolution      Conv_51                  1 1 relu_49.tmp_0 conv2d_379.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_21                   2 1 conv2d_379.tmp_0 relu_48.tmp_0_splitncnn_0 elementwise_add_19 0=0
ReLU             Relu_50                  1 1 elementwise_add_19 relu_50.tmp_0
Split            splitncnn_27             1 4 relu_50.tmp_0 relu_50.tmp_0_splitncnn_0 relu_50.tmp_0_splitncnn_1 relu_50.tmp_0_splitncnn_2 relu_50.tmp_0_splitncnn_3
Convolution      Conv_52                  1 1 relu_34.tmp_0_splitncnn_1 conv2d_380.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_51                  1 1 conv2d_380.tmp_0 relu_51.tmp_0
Convolution      Conv_53                  1 1 relu_51.tmp_0 conv2d_381.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_22                   2 1 conv2d_381.tmp_0 relu_34.tmp_0_splitncnn_0 elementwise_add_20 0=0
ReLU             Relu_52                  1 1 elementwise_add_20 relu_52.tmp_0
Split            splitncnn_28             1 2 relu_52.tmp_0 relu_52.tmp_0_splitncnn_0 relu_52.tmp_0_splitncnn_1
Convolution      Conv_54                  1 1 relu_52.tmp_0_splitncnn_1 conv2d_382.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_53                  1 1 conv2d_382.tmp_0 relu_53.tmp_0
Convolution      Conv_55                  1 1 relu_53.tmp_0 conv2d_383.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_23                   2 1 conv2d_383.tmp_0 relu_52.tmp_0_splitncnn_0 elementwise_add_21 0=0
ReLU             Relu_54                  1 1 elementwise_add_21 relu_54.tmp_0
Split            splitncnn_29             1 2 relu_54.tmp_0 relu_54.tmp_0_splitncnn_0 relu_54.tmp_0_splitncnn_1
Convolution      Conv_56                  1 1 relu_54.tmp_0_splitncnn_1 conv2d_384.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_55                  1 1 conv2d_384.tmp_0 relu_55.tmp_0
Convolution      Conv_57                  1 1 relu_55.tmp_0 conv2d_385.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_24                   2 1 conv2d_385.tmp_0 relu_54.tmp_0_splitncnn_0 elementwise_add_22 0=0
ReLU             Relu_56                  1 1 elementwise_add_22 relu_56.tmp_0
Split            splitncnn_30             1 2 relu_56.tmp_0 relu_56.tmp_0_splitncnn_0 relu_56.tmp_0_splitncnn_1
Convolution      Conv_58                  1 1 relu_56.tmp_0_splitncnn_1 conv2d_386.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_57                  1 1 conv2d_386.tmp_0 relu_57.tmp_0
Convolution      Conv_59                  1 1 relu_57.tmp_0 conv2d_387.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_25                   2 1 conv2d_387.tmp_0 relu_56.tmp_0_splitncnn_0 elementwise_add_23 0=0
ReLU             Relu_58                  1 1 elementwise_add_23 relu_58.tmp_0
Split            splitncnn_31             1 3 relu_58.tmp_0 relu_58.tmp_0_splitncnn_0 relu_58.tmp_0_splitncnn_1 relu_58.tmp_0_splitncnn_2
Shape            Shape_2                  1 1 relu_42.tmp_0_splitncnn_3 Shape_2
Cast             Cast_2                   1 1 Shape_2 shape_2.tmp_0
Crop             Slice_2                  1 1 shape_2.tmp_0 shape_2.tmp_0_slice_0 -23309=0 -23310=0
Split            splitncnn_32             1 2 shape_2.tmp_0_slice_0 shape_2.tmp_0_slice_0_splitncnn_0 shape_2.tmp_0_slice_0_splitncnn_1
Convolution      Conv_60                  1 1 relu_50.tmp_0_splitncnn_3 conv2d_388.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=648
Split            splitncnn_33             1 2 conv2d_388.tmp_0 conv2d_388.tmp_0_splitncnn_0 conv2d_388.tmp_0_splitncnn_1
Shape            Shape_3                  1 1 conv2d_388.tmp_0_splitncnn_1 Shape_3
Crop             Slice_3                  1 1 Shape_3 Slice_3 -23309=1,0 -23310=1,2
Cast             Cast_3                   1 1 shape_2.tmp_0_slice_0_splitncnn_1 Cast_3
Concat           Concat_1                 2 1 Slice_3 Cast_3 Concat_1 0=0
Interp           Resize_1                 2 1 conv2d_388.tmp_0_splitncnn_0 Concat_1 bilinear_interp_v2_1.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_26                   2 1 relu_42.tmp_0_splitncnn_2 bilinear_interp_v2_1.tmp_0 tmp_2 0=0
Convolution      Conv_61                  1 1 relu_58.tmp_0_splitncnn_2 conv2d_389.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=1296
Split            splitncnn_34             1 2 conv2d_389.tmp_0 conv2d_389.tmp_0_splitncnn_0 conv2d_389.tmp_0_splitncnn_1
Shape            Shape_4                  1 1 conv2d_389.tmp_0_splitncnn_1 Shape_4
Crop             Slice_4                  1 1 Shape_4 Slice_4 -23309=1,0 -23310=1,2
Cast             Cast_4                   1 1 shape_2.tmp_0_slice_0_splitncnn_0 Cast_4
Concat           Concat_2                 2 1 Slice_4 Cast_4 Concat_2 0=0
Interp           Resize_2                 2 1 conv2d_389.tmp_0_splitncnn_0 Concat_2 bilinear_interp_v2_2.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_27                   2 1 tmp_2 bilinear_interp_v2_2.tmp_0 tmp_3 0=0
ReLU             Relu_59                  1 1 tmp_3 relu_59.tmp_0
Split            splitncnn_35             1 2 relu_59.tmp_0 relu_59.tmp_0_splitncnn_0 relu_59.tmp_0_splitncnn_1
Shape            Shape_5                  1 1 relu_50.tmp_0_splitncnn_2 Shape_5
Cast             Cast_5                   1 1 Shape_5 shape_3.tmp_0
Crop             Slice_5                  1 1 shape_3.tmp_0 shape_3.tmp_0_slice_0 -23309=0 -23310=0
Convolution      Conv_62                  1 1 relu_42.tmp_0_splitncnn_1 conv2d_390.tmp_0 0=36 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=5832
BinaryOp         Add_28                   2 1 relu_50.tmp_0_splitncnn_1 conv2d_390.tmp_0 tmp_4 0=0
Convolution      Conv_63                  1 1 relu_58.tmp_0_splitncnn_1 conv2d_391.tmp_0 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=2592
Split            splitncnn_36             1 2 conv2d_391.tmp_0 conv2d_391.tmp_0_splitncnn_0 conv2d_391.tmp_0_splitncnn_1
Shape            Shape_6                  1 1 conv2d_391.tmp_0_splitncnn_1 Shape_6
Crop             Slice_6                  1 1 Shape_6 Slice_6 -23309=1,0 -23310=1,2
Cast             Cast_6                   1 1 shape_3.tmp_0_slice_0 Cast_6
Concat           Concat_3                 2 1 Slice_6 Cast_6 Concat_3 0=0
Interp           Resize_3                 2 1 conv2d_391.tmp_0_splitncnn_0 Concat_3 bilinear_interp_v2_3.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_29                   2 1 tmp_4 bilinear_interp_v2_3.tmp_0 tmp_5 0=0
ReLU             Relu_60                  1 1 tmp_5 relu_60.tmp_0
Split            splitncnn_37             1 2 relu_60.tmp_0 relu_60.tmp_0_splitncnn_0 relu_60.tmp_0_splitncnn_1
Convolution      Conv_64                  1 1 relu_42.tmp_0_splitncnn_0 conv2d_392.tmp_0 0=18 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=2916
ReLU             Relu_61                  1 1 conv2d_392.tmp_0 relu_61.tmp_0
Convolution      Conv_65                  1 1 relu_61.tmp_0 conv2d_393.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=11664
BinaryOp         Add_30                   2 1 relu_58.tmp_0_splitncnn_0 conv2d_393.tmp_0 tmp_6 0=0
Convolution      Conv_66                  1 1 relu_50.tmp_0_splitncnn_0 conv2d_394.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=23328
BinaryOp         Add_31                   2 1 tmp_6 conv2d_394.tmp_0 tmp_7 0=0
ReLU             Relu_62                  1 1 tmp_7 relu_62.tmp_0
Split            splitncnn_38             1 2 relu_62.tmp_0 relu_62.tmp_0_splitncnn_0 relu_62.tmp_0_splitncnn_1
Convolution      Conv_67                  1 1 relu_59.tmp_0_splitncnn_1 conv2d_395.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_63                  1 1 conv2d_395.tmp_0 relu_63.tmp_0
Convolution      Conv_68                  1 1 relu_63.tmp_0 conv2d_396.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_32                   2 1 conv2d_396.tmp_0 relu_59.tmp_0_splitncnn_0 elementwise_add_24 0=0
ReLU             Relu_64                  1 1 elementwise_add_24 relu_64.tmp_0
Split            splitncnn_39             1 2 relu_64.tmp_0 relu_64.tmp_0_splitncnn_0 relu_64.tmp_0_splitncnn_1
Convolution      Conv_69                  1 1 relu_64.tmp_0_splitncnn_1 conv2d_397.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_65                  1 1 conv2d_397.tmp_0 relu_65.tmp_0
Convolution      Conv_70                  1 1 relu_65.tmp_0 conv2d_398.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_33                   2 1 conv2d_398.tmp_0 relu_64.tmp_0_splitncnn_0 elementwise_add_25 0=0
ReLU             Relu_66                  1 1 elementwise_add_25 relu_66.tmp_0
Split            splitncnn_40             1 2 relu_66.tmp_0 relu_66.tmp_0_splitncnn_0 relu_66.tmp_0_splitncnn_1
Convolution      Conv_71                  1 1 relu_66.tmp_0_splitncnn_1 conv2d_399.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_67                  1 1 conv2d_399.tmp_0 relu_67.tmp_0
Convolution      Conv_72                  1 1 relu_67.tmp_0 conv2d_400.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_34                   2 1 conv2d_400.tmp_0 relu_66.tmp_0_splitncnn_0 elementwise_add_26 0=0
ReLU             Relu_68                  1 1 elementwise_add_26 relu_68.tmp_0
Split            splitncnn_41             1 2 relu_68.tmp_0 relu_68.tmp_0_splitncnn_0 relu_68.tmp_0_splitncnn_1
Convolution      Conv_73                  1 1 relu_68.tmp_0_splitncnn_1 conv2d_401.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_69                  1 1 conv2d_401.tmp_0 relu_69.tmp_0
Convolution      Conv_74                  1 1 relu_69.tmp_0 conv2d_402.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_35                   2 1 conv2d_402.tmp_0 relu_68.tmp_0_splitncnn_0 elementwise_add_27 0=0
ReLU             Relu_70                  1 1 elementwise_add_27 relu_70.tmp_0
Split            splitncnn_42             1 4 relu_70.tmp_0 relu_70.tmp_0_splitncnn_0 relu_70.tmp_0_splitncnn_1 relu_70.tmp_0_splitncnn_2 relu_70.tmp_0_splitncnn_3
Convolution      Conv_75                  1 1 relu_60.tmp_0_splitncnn_1 conv2d_403.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_71                  1 1 conv2d_403.tmp_0 relu_71.tmp_0
Convolution      Conv_76                  1 1 relu_71.tmp_0 conv2d_404.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_36                   2 1 conv2d_404.tmp_0 relu_60.tmp_0_splitncnn_0 elementwise_add_28 0=0
ReLU             Relu_72                  1 1 elementwise_add_28 relu_72.tmp_0
Split            splitncnn_43             1 2 relu_72.tmp_0 relu_72.tmp_0_splitncnn_0 relu_72.tmp_0_splitncnn_1
Convolution      Conv_77                  1 1 relu_72.tmp_0_splitncnn_1 conv2d_405.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_73                  1 1 conv2d_405.tmp_0 relu_73.tmp_0
Convolution      Conv_78                  1 1 relu_73.tmp_0 conv2d_406.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_37                   2 1 conv2d_406.tmp_0 relu_72.tmp_0_splitncnn_0 elementwise_add_29 0=0
ReLU             Relu_74                  1 1 elementwise_add_29 relu_74.tmp_0
Split            splitncnn_44             1 2 relu_74.tmp_0 relu_74.tmp_0_splitncnn_0 relu_74.tmp_0_splitncnn_1
Convolution      Conv_79                  1 1 relu_74.tmp_0_splitncnn_1 conv2d_407.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_75                  1 1 conv2d_407.tmp_0 relu_75.tmp_0
Convolution      Conv_80                  1 1 relu_75.tmp_0 conv2d_408.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_38                   2 1 conv2d_408.tmp_0 relu_74.tmp_0_splitncnn_0 elementwise_add_30 0=0
ReLU             Relu_76                  1 1 elementwise_add_30 relu_76.tmp_0
Split            splitncnn_45             1 2 relu_76.tmp_0 relu_76.tmp_0_splitncnn_0 relu_76.tmp_0_splitncnn_1
Convolution      Conv_81                  1 1 relu_76.tmp_0_splitncnn_1 conv2d_409.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_77                  1 1 conv2d_409.tmp_0 relu_77.tmp_0
Convolution      Conv_82                  1 1 relu_77.tmp_0 conv2d_410.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_39                   2 1 conv2d_410.tmp_0 relu_76.tmp_0_splitncnn_0 elementwise_add_31 0=0
ReLU             Relu_78                  1 1 elementwise_add_31 relu_78.tmp_0
Split            splitncnn_46             1 4 relu_78.tmp_0 relu_78.tmp_0_splitncnn_0 relu_78.tmp_0_splitncnn_1 relu_78.tmp_0_splitncnn_2 relu_78.tmp_0_splitncnn_3
Convolution      Conv_83                  1 1 relu_62.tmp_0_splitncnn_1 conv2d_411.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_79                  1 1 conv2d_411.tmp_0 relu_79.tmp_0
Convolution      Conv_84                  1 1 relu_79.tmp_0 conv2d_412.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_40                   2 1 conv2d_412.tmp_0 relu_62.tmp_0_splitncnn_0 elementwise_add_32 0=0
ReLU             Relu_80                  1 1 elementwise_add_32 relu_80.tmp_0
Split            splitncnn_47             1 2 relu_80.tmp_0 relu_80.tmp_0_splitncnn_0 relu_80.tmp_0_splitncnn_1
Convolution      Conv_85                  1 1 relu_80.tmp_0_splitncnn_1 conv2d_413.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_81                  1 1 conv2d_413.tmp_0 relu_81.tmp_0
Convolution      Conv_86                  1 1 relu_81.tmp_0 conv2d_414.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_41                   2 1 conv2d_414.tmp_0 relu_80.tmp_0_splitncnn_0 elementwise_add_33 0=0
ReLU             Relu_82                  1 1 elementwise_add_33 relu_82.tmp_0
Split            splitncnn_48             1 2 relu_82.tmp_0 relu_82.tmp_0_splitncnn_0 relu_82.tmp_0_splitncnn_1
Convolution      Conv_87                  1 1 relu_82.tmp_0_splitncnn_1 conv2d_415.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_83                  1 1 conv2d_415.tmp_0 relu_83.tmp_0
Convolution      Conv_88                  1 1 relu_83.tmp_0 conv2d_416.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_42                   2 1 conv2d_416.tmp_0 relu_82.tmp_0_splitncnn_0 elementwise_add_34 0=0
ReLU             Relu_84                  1 1 elementwise_add_34 relu_84.tmp_0
Split            splitncnn_49             1 2 relu_84.tmp_0 relu_84.tmp_0_splitncnn_0 relu_84.tmp_0_splitncnn_1
Convolution      Conv_89                  1 1 relu_84.tmp_0_splitncnn_1 conv2d_417.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_85                  1 1 conv2d_417.tmp_0 relu_85.tmp_0
Convolution      Conv_90                  1 1 relu_85.tmp_0 conv2d_418.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_43                   2 1 conv2d_418.tmp_0 relu_84.tmp_0_splitncnn_0 elementwise_add_35 0=0
ReLU             Relu_86                  1 1 elementwise_add_35 relu_86.tmp_0
Split            splitncnn_50             1 3 relu_86.tmp_0 relu_86.tmp_0_splitncnn_0 relu_86.tmp_0_splitncnn_1 relu_86.tmp_0_splitncnn_2
Shape            Shape_7                  1 1 relu_70.tmp_0_splitncnn_3 Shape_7
Cast             Cast_7                   1 1 Shape_7 shape_5.tmp_0
Crop             Slice_7                  1 1 shape_5.tmp_0 shape_5.tmp_0_slice_0 -23309=0 -23310=0
Split            splitncnn_51             1 2 shape_5.tmp_0_slice_0 shape_5.tmp_0_slice_0_splitncnn_0 shape_5.tmp_0_slice_0_splitncnn_1
Convolution      Conv_91                  1 1 relu_78.tmp_0_splitncnn_3 conv2d_419.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=648
Split            splitncnn_52             1 2 conv2d_419.tmp_0 conv2d_419.tmp_0_splitncnn_0 conv2d_419.tmp_0_splitncnn_1
Shape            Shape_8                  1 1 conv2d_419.tmp_0_splitncnn_1 Shape_8
Crop             Slice_8                  1 1 Shape_8 Slice_8 -23309=1,0 -23310=1,2
Cast             Cast_8                   1 1 shape_5.tmp_0_slice_0_splitncnn_1 Cast_8
Concat           Concat_4                 2 1 Slice_8 Cast_8 Concat_4 0=0
Interp           Resize_4                 2 1 conv2d_419.tmp_0_splitncnn_0 Concat_4 bilinear_interp_v2_4.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_44                   2 1 relu_70.tmp_0_splitncnn_2 bilinear_interp_v2_4.tmp_0 tmp_8 0=0
Convolution      Conv_92                  1 1 relu_86.tmp_0_splitncnn_2 conv2d_420.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=1296
Split            splitncnn_53             1 2 conv2d_420.tmp_0 conv2d_420.tmp_0_splitncnn_0 conv2d_420.tmp_0_splitncnn_1
Shape            Shape_9                  1 1 conv2d_420.tmp_0_splitncnn_1 Shape_9
Crop             Slice_9                  1 1 Shape_9 Slice_9 -23309=1,0 -23310=1,2
Cast             Cast_9                   1 1 shape_5.tmp_0_slice_0_splitncnn_0 Cast_9
Concat           Concat_5                 2 1 Slice_9 Cast_9 Concat_5 0=0
Interp           Resize_5                 2 1 conv2d_420.tmp_0_splitncnn_0 Concat_5 bilinear_interp_v2_5.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_45                   2 1 tmp_8 bilinear_interp_v2_5.tmp_0 tmp_9 0=0
ReLU             Relu_87                  1 1 tmp_9 relu_87.tmp_0
Split            splitncnn_54             1 2 relu_87.tmp_0 relu_87.tmp_0_splitncnn_0 relu_87.tmp_0_splitncnn_1
Shape            Shape_10                 1 1 relu_78.tmp_0_splitncnn_2 Shape_10
Cast             Cast_10                  1 1 Shape_10 shape_6.tmp_0
Crop             Slice_10                 1 1 shape_6.tmp_0 shape_6.tmp_0_slice_0 -23309=0 -23310=0
Convolution      Conv_93                  1 1 relu_70.tmp_0_splitncnn_1 conv2d_421.tmp_0 0=36 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=5832
BinaryOp         Add_46                   2 1 relu_78.tmp_0_splitncnn_1 conv2d_421.tmp_0 tmp_10 0=0
Convolution      Conv_94                  1 1 relu_86.tmp_0_splitncnn_1 conv2d_422.tmp_0 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=2592
Split            splitncnn_55             1 2 conv2d_422.tmp_0 conv2d_422.tmp_0_splitncnn_0 conv2d_422.tmp_0_splitncnn_1
Shape            Shape_11                 1 1 conv2d_422.tmp_0_splitncnn_1 Shape_11
Crop             Slice_11                 1 1 Shape_11 Slice_11 -23309=1,0 -23310=1,2
Cast             Cast_11                  1 1 shape_6.tmp_0_slice_0 Cast_11
Concat           Concat_6                 2 1 Slice_11 Cast_11 Concat_6 0=0
Interp           Resize_6                 2 1 conv2d_422.tmp_0_splitncnn_0 Concat_6 bilinear_interp_v2_6.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_47                   2 1 tmp_10 bilinear_interp_v2_6.tmp_0 tmp_11 0=0
ReLU             Relu_88                  1 1 tmp_11 relu_88.tmp_0
Split            splitncnn_56             1 2 relu_88.tmp_0 relu_88.tmp_0_splitncnn_0 relu_88.tmp_0_splitncnn_1
Convolution      Conv_95                  1 1 relu_70.tmp_0_splitncnn_0 conv2d_423.tmp_0 0=18 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=2916
ReLU             Relu_89                  1 1 conv2d_423.tmp_0 relu_89.tmp_0
Convolution      Conv_96                  1 1 relu_89.tmp_0 conv2d_424.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=11664
BinaryOp         Add_48                   2 1 relu_86.tmp_0_splitncnn_0 conv2d_424.tmp_0 tmp_12 0=0
Convolution      Conv_97                  1 1 relu_78.tmp_0_splitncnn_0 conv2d_425.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=23328
BinaryOp         Add_49                   2 1 tmp_12 conv2d_425.tmp_0 tmp_13 0=0
ReLU             Relu_90                  1 1 tmp_13 relu_90.tmp_0
Split            splitncnn_57             1 2 relu_90.tmp_0 relu_90.tmp_0_splitncnn_0 relu_90.tmp_0_splitncnn_1
Convolution      Conv_98                  1 1 relu_87.tmp_0_splitncnn_1 conv2d_426.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_91                  1 1 conv2d_426.tmp_0 relu_91.tmp_0
Convolution      Conv_99                  1 1 relu_91.tmp_0 conv2d_427.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_50                   2 1 conv2d_427.tmp_0 relu_87.tmp_0_splitncnn_0 elementwise_add_36 0=0
ReLU             Relu_92                  1 1 elementwise_add_36 relu_92.tmp_0
Split            splitncnn_58             1 2 relu_92.tmp_0 relu_92.tmp_0_splitncnn_0 relu_92.tmp_0_splitncnn_1
Convolution      Conv_100                 1 1 relu_92.tmp_0_splitncnn_1 conv2d_428.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_93                  1 1 conv2d_428.tmp_0 relu_93.tmp_0
Convolution      Conv_101                 1 1 relu_93.tmp_0 conv2d_429.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_51                   2 1 conv2d_429.tmp_0 relu_92.tmp_0_splitncnn_0 elementwise_add_37 0=0
ReLU             Relu_94                  1 1 elementwise_add_37 relu_94.tmp_0
Split            splitncnn_59             1 2 relu_94.tmp_0 relu_94.tmp_0_splitncnn_0 relu_94.tmp_0_splitncnn_1
Convolution      Conv_102                 1 1 relu_94.tmp_0_splitncnn_1 conv2d_430.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_95                  1 1 conv2d_430.tmp_0 relu_95.tmp_0
Convolution      Conv_103                 1 1 relu_95.tmp_0 conv2d_431.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_52                   2 1 conv2d_431.tmp_0 relu_94.tmp_0_splitncnn_0 elementwise_add_38 0=0
ReLU             Relu_96                  1 1 elementwise_add_38 relu_96.tmp_0
Split            splitncnn_60             1 2 relu_96.tmp_0 relu_96.tmp_0_splitncnn_0 relu_96.tmp_0_splitncnn_1
Convolution      Conv_104                 1 1 relu_96.tmp_0_splitncnn_1 conv2d_432.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_97                  1 1 conv2d_432.tmp_0 relu_97.tmp_0
Convolution      Conv_105                 1 1 relu_97.tmp_0 conv2d_433.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
BinaryOp         Add_53                   2 1 conv2d_433.tmp_0 relu_96.tmp_0_splitncnn_0 elementwise_add_39 0=0
ReLU             Relu_98                  1 1 elementwise_add_39 relu_98.tmp_0
Split            splitncnn_61             1 4 relu_98.tmp_0 relu_98.tmp_0_splitncnn_0 relu_98.tmp_0_splitncnn_1 relu_98.tmp_0_splitncnn_2 relu_98.tmp_0_splitncnn_3
Convolution      Conv_106                 1 1 relu_88.tmp_0_splitncnn_1 conv2d_434.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_99                  1 1 conv2d_434.tmp_0 relu_99.tmp_0
Convolution      Conv_107                 1 1 relu_99.tmp_0 conv2d_435.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_54                   2 1 conv2d_435.tmp_0 relu_88.tmp_0_splitncnn_0 elementwise_add_40 0=0
ReLU             Relu_100                 1 1 elementwise_add_40 relu_100.tmp_0
Split            splitncnn_62             1 2 relu_100.tmp_0 relu_100.tmp_0_splitncnn_0 relu_100.tmp_0_splitncnn_1
Convolution      Conv_108                 1 1 relu_100.tmp_0_splitncnn_1 conv2d_436.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_101                 1 1 conv2d_436.tmp_0 relu_101.tmp_0
Convolution      Conv_109                 1 1 relu_101.tmp_0 conv2d_437.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_55                   2 1 conv2d_437.tmp_0 relu_100.tmp_0_splitncnn_0 elementwise_add_41 0=0
ReLU             Relu_102                 1 1 elementwise_add_41 relu_102.tmp_0
Split            splitncnn_63             1 2 relu_102.tmp_0 relu_102.tmp_0_splitncnn_0 relu_102.tmp_0_splitncnn_1
Convolution      Conv_110                 1 1 relu_102.tmp_0_splitncnn_1 conv2d_438.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_103                 1 1 conv2d_438.tmp_0 relu_103.tmp_0
Convolution      Conv_111                 1 1 relu_103.tmp_0 conv2d_439.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_56                   2 1 conv2d_439.tmp_0 relu_102.tmp_0_splitncnn_0 elementwise_add_42 0=0
ReLU             Relu_104                 1 1 elementwise_add_42 relu_104.tmp_0
Split            splitncnn_64             1 2 relu_104.tmp_0 relu_104.tmp_0_splitncnn_0 relu_104.tmp_0_splitncnn_1
Convolution      Conv_112                 1 1 relu_104.tmp_0_splitncnn_1 conv2d_440.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
ReLU             Relu_105                 1 1 conv2d_440.tmp_0 relu_105.tmp_0
Convolution      Conv_113                 1 1 relu_105.tmp_0 conv2d_441.tmp_0 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=11664
BinaryOp         Add_57                   2 1 conv2d_441.tmp_0 relu_104.tmp_0_splitncnn_0 elementwise_add_43 0=0
ReLU             Relu_106                 1 1 elementwise_add_43 relu_106.tmp_0
Split            splitncnn_65             1 4 relu_106.tmp_0 relu_106.tmp_0_splitncnn_0 relu_106.tmp_0_splitncnn_1 relu_106.tmp_0_splitncnn_2 relu_106.tmp_0_splitncnn_3
Convolution      Conv_114                 1 1 relu_90.tmp_0_splitncnn_1 conv2d_442.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_107                 1 1 conv2d_442.tmp_0 relu_107.tmp_0
Convolution      Conv_115                 1 1 relu_107.tmp_0 conv2d_443.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_58                   2 1 conv2d_443.tmp_0 relu_90.tmp_0_splitncnn_0 elementwise_add_44 0=0
ReLU             Relu_108                 1 1 elementwise_add_44 relu_108.tmp_0
Split            splitncnn_66             1 2 relu_108.tmp_0 relu_108.tmp_0_splitncnn_0 relu_108.tmp_0_splitncnn_1
Convolution      Conv_116                 1 1 relu_108.tmp_0_splitncnn_1 conv2d_444.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_109                 1 1 conv2d_444.tmp_0 relu_109.tmp_0
Convolution      Conv_117                 1 1 relu_109.tmp_0 conv2d_445.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_59                   2 1 conv2d_445.tmp_0 relu_108.tmp_0_splitncnn_0 elementwise_add_45 0=0
ReLU             Relu_110                 1 1 elementwise_add_45 relu_110.tmp_0
Split            splitncnn_67             1 2 relu_110.tmp_0 relu_110.tmp_0_splitncnn_0 relu_110.tmp_0_splitncnn_1
Convolution      Conv_118                 1 1 relu_110.tmp_0_splitncnn_1 conv2d_446.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_111                 1 1 conv2d_446.tmp_0 relu_111.tmp_0
Convolution      Conv_119                 1 1 relu_111.tmp_0 conv2d_447.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_60                   2 1 conv2d_447.tmp_0 relu_110.tmp_0_splitncnn_0 elementwise_add_46 0=0
ReLU             Relu_112                 1 1 elementwise_add_46 relu_112.tmp_0
Split            splitncnn_68             1 2 relu_112.tmp_0 relu_112.tmp_0_splitncnn_0 relu_112.tmp_0_splitncnn_1
Convolution      Conv_120                 1 1 relu_112.tmp_0_splitncnn_1 conv2d_448.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
ReLU             Relu_113                 1 1 conv2d_448.tmp_0 relu_113.tmp_0
Convolution      Conv_121                 1 1 relu_113.tmp_0 conv2d_449.tmp_0 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=46656
BinaryOp         Add_61                   2 1 conv2d_449.tmp_0 relu_112.tmp_0_splitncnn_0 elementwise_add_47 0=0
ReLU             Relu_114                 1 1 elementwise_add_47 relu_114.tmp_0
Split            splitncnn_69             1 3 relu_114.tmp_0 relu_114.tmp_0_splitncnn_0 relu_114.tmp_0_splitncnn_1 relu_114.tmp_0_splitncnn_2
Shape            Shape_12                 1 1 relu_98.tmp_0_splitncnn_3 Shape_12
Cast             Cast_12                  1 1 Shape_12 shape_8.tmp_0
Crop             Slice_12                 1 1 shape_8.tmp_0 shape_8.tmp_0_slice_0 -23309=0 -23310=0
Split            splitncnn_70             1 2 shape_8.tmp_0_slice_0 shape_8.tmp_0_slice_0_splitncnn_0 shape_8.tmp_0_slice_0_splitncnn_1
Convolution      Conv_122                 1 1 relu_106.tmp_0_splitncnn_3 conv2d_450.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=648
Split            splitncnn_71             1 2 conv2d_450.tmp_0 conv2d_450.tmp_0_splitncnn_0 conv2d_450.tmp_0_splitncnn_1
Shape            Shape_13                 1 1 conv2d_450.tmp_0_splitncnn_1 Shape_13
Crop             Slice_13                 1 1 Shape_13 Slice_13 -23309=1,0 -23310=1,2
Cast             Cast_13                  1 1 shape_8.tmp_0_slice_0_splitncnn_1 Cast_13
Concat           Concat_7                 2 1 Slice_13 Cast_13 Concat_7 0=0
Interp           Resize_7                 2 1 conv2d_450.tmp_0_splitncnn_0 Concat_7 bilinear_interp_v2_7.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_62                   2 1 relu_98.tmp_0_splitncnn_2 bilinear_interp_v2_7.tmp_0 tmp_14 0=0
Convolution      Conv_123                 1 1 relu_114.tmp_0_splitncnn_2 conv2d_451.tmp_0 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=1296
Split            splitncnn_72             1 2 conv2d_451.tmp_0 conv2d_451.tmp_0_splitncnn_0 conv2d_451.tmp_0_splitncnn_1
Shape            Shape_14                 1 1 conv2d_451.tmp_0_splitncnn_1 Shape_14
Crop             Slice_14                 1 1 Shape_14 Slice_14 -23309=1,0 -23310=1,2
Cast             Cast_14                  1 1 shape_8.tmp_0_slice_0_splitncnn_0 Cast_14
Concat           Concat_8                 2 1 Slice_14 Cast_14 Concat_8 0=0
Interp           Resize_8                 2 1 conv2d_451.tmp_0_splitncnn_0 Concat_8 bilinear_interp_v2_8.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_63                   2 1 tmp_14 bilinear_interp_v2_8.tmp_0 tmp_15 0=0
ReLU             Relu_115                 1 1 tmp_15 relu_115.tmp_0
Split            splitncnn_73             1 2 relu_115.tmp_0 relu_115.tmp_0_splitncnn_0 relu_115.tmp_0_splitncnn_1
Shape            Shape_15                 1 1 relu_106.tmp_0_splitncnn_2 Shape_15
Cast             Cast_15                  1 1 Shape_15 shape_9.tmp_0
Crop             Slice_15                 1 1 shape_9.tmp_0 shape_9.tmp_0_slice_0 -23309=0 -23310=0
Convolution      Conv_124                 1 1 relu_98.tmp_0_splitncnn_1 conv2d_452.tmp_0 0=36 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=5832
BinaryOp         Add_64                   2 1 relu_106.tmp_0_splitncnn_1 conv2d_452.tmp_0 tmp_16 0=0
Convolution      Conv_125                 1 1 relu_114.tmp_0_splitncnn_1 conv2d_453.tmp_0 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=1 6=2592
Split            splitncnn_74             1 2 conv2d_453.tmp_0 conv2d_453.tmp_0_splitncnn_0 conv2d_453.tmp_0_splitncnn_1
Shape            Shape_16                 1 1 conv2d_453.tmp_0_splitncnn_1 Shape_16
Crop             Slice_16                 1 1 Shape_16 Slice_16 -23309=1,0 -23310=1,2
Cast             Cast_16                  1 1 shape_9.tmp_0_slice_0 Cast_16
Concat           Concat_9                 2 1 Slice_16 Cast_16 Concat_9 0=0
Interp           Resize_9                 2 1 conv2d_453.tmp_0_splitncnn_0 Concat_9 bilinear_interp_v2_9.tmp_0 0=2 1=1.000000e+00 2=1.000000e+00 3=0 4=0 6=0
BinaryOp         Add_65                   2 1 tmp_16 bilinear_interp_v2_9.tmp_0 tmp_17 0=0
ReLU             Relu_116                 1 1 tmp_17 relu_116.tmp_0
Split            splitncnn_75             1 2 relu_116.tmp_0 relu_116.tmp_0_splitncnn_0 relu_116.tmp_0_splitncnn_1
Convolution      Conv_126                 1 1 relu_98.tmp_0_splitncnn_0 conv2d_454.tmp_0 0=18 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=2916
ReLU             Relu_117                 1 1 conv2d_454.tmp_0 relu_117.tmp_0
Convolution      Conv_127                 1 1 relu_117.tmp_0 conv2d_455.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=11664
BinaryOp         Add_66                   2 1 relu_114.tmp_0_splitncnn_0 conv2d_455.tmp_0 tmp_18 0=0
Convolution      Conv_128                 1 1 relu_106.tmp_0_splitncnn_0 conv2d_456.tmp_0 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=1 6=23328
BinaryOp         Add_67                   2 1 tmp_18 conv2d_456.tmp_0 tmp_19 0=0
ReLU             Relu_118                 1 1 tmp_19 relu_118.tmp_0
Split            splitncnn_76             1 2 relu_118.tmp_0 relu_118.tmp_0_splitncnn_0 relu_118.tmp_0_splitncnn_1
Convolution      Conv_129                 1 1 relu_115.tmp_0_splitncnn_1 conv2d_457.tmp_0 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=1 6=2916
ReLU             Relu_119                 1 1 conv2d_457.tmp_0 relu_119.tmp_0
